/*Ця програма потрібна для того щоб визначити чі круг помістиця в квадрат 
знаючи радіус круга та довжину сторони квадрата

*/
#include <stdio.h> // підключаємо необхідну для роботи бібліотекуі

int main() {
    float r, a, Skr, Skv; // оголошуємо змінні для радіусу, довжини сторони та площ

    printf("Введіть радіус круга: "); // просимо юзера ввести радіус
    scanf_s("%f", &r);

    printf("Введіть довжину сторони квадрата: "); // просимо юзера ввести довжину сторони
    scanf_s("%f", &a);

    Skr = 3.14 * r * r; // обчислюємо площу круга за формулою
    Skv = a * a; // обчислюємо площу квадрата за формулою

    if (Skr <= Skv) {
        printf("Круг поміститься у квадраті.\n");
    }
    else {
        printf("Круг не поміститься у квадраті.\n");//Виводимо інформацію на екран юзера
    }

    return 0;//кінець програми
}